Tekla.Structures.Internal.dotComponentOptions_t


Tekla.Structures.Internal.dotComponentOptions_t.PlateProfileName
The plate profile name.

Tekla.Structures.Internal.dotComponentOptions_t.FoldedPlateProfileName
The folded plate profile name.

Tekla.Structures.Internal.dotComponentOptions_t.BoltEdgeDistanceFactor
The factor of bolt edge distance.

Tekla.Structures.Internal.dotComponentOptions_t.BoltEdgeDistanceReference
The bolt edge distance reference.

Tekla.Structures.Internal.dotComponentOptions_t.BoltStandard
The bolt standard.

Tekla.Structures.Internal.dotComponentOptions_t.BoltSize
The bolt size.

Tekla.Structures.Internal.dotComponentOptions_t.PartMaterial
The part material.

Tekla.Structures.Internal.dotComponentOptions_t.PartWeldedToPrimaryStartNumber
The part welded to primary start number.

Tekla.Structures.Internal.dotComponentOptions_t.PartWeldedToSecondaryStartNumber
The part welded to secondary start number.

Tekla.Structures.Internal.dotComponentOptions_t.LoosePartStartNumber
The loose part start number.

Tekla.Structures.Internal.dotComponentOptions_t.AssemblyLoosePartStartNumber
The assembly loose part number.

Tekla.Structures.Internal.dotComponentOptions_t.GetSet
Get = 0; Set = 1;